interface StyledLetterMap { [key: string]: string[] }

export type StyleType =
    | 'bold'
    | 'italic'
    | 'boldItalic'
    | 'script'
    | 'boldScript'
    | 'fraktur'
    | 'doubleStruck'
    | 'sansSerif'
    | 'sansSerifBold'
    | 'sansSerifItalic'
    | 'sansSerifBoldItalic'
    | 'monospace';

export const STYLE_INDEX: Record<StyleType, number> = {
  bold: 0,
  italic: 1,
  boldItalic: 2,
  script: 3,
  boldScript: 4,
  fraktur: 5,
  doubleStruck: 6,
  sansSerif: 7,
  sansSerifBold: 8,
  sansSerifItalic: 9,
  sansSerifBoldItalic: 10,
  monospace: 11,
};

export const DIGIT_STYLE_MAP: Record<StyleType, number | null> = {
  bold: 0,
  italic: null,
  boldItalic: 0,
  script: null,
  boldScript: null,
  fraktur: null,
  doubleStruck: 1,
  sansSerifBold: 3,
  sansSerifBoldItalic: 3,
  sansSerif: 2,
  sansSerifItalic: 2,
  monospace: 4,
};

export const GREEK_STYLE_MAP: Record<StyleType, number | null> = {
  bold: 0,
  italic: 1,
  boldItalic: 2,
  script: null,
  boldScript: null,
  fraktur: null,
  doubleStruck: null,
  sansSerifBold: 3,
  sansSerifBoldItalic: 4,
  sansSerif: null,
  sansSerifItalic: 1,
  monospace: null,
};

export const styledLetters: StyledLetterMap = {
  A: ['𝐀', '𝐴', '𝑨', '𝒜', '𝓐', '𝕬', '𝔸', '𝖠', '𝗔', '𝘈', '𝘼', '𝙰'],
  B: ['𝐁', '𝐵', '𝑩', 'ℬ', '𝓑', '𝕭', '𝔹', '𝖡', '𝗕', '𝘉', '𝘽', '𝙱'],
  C: ['𝐂', '𝐶', '𝑪', '𝒞', '𝓒', '𝕮', 'ℂ', '𝖢', '𝗖', '𝘊', '𝘾', '𝙲'],
  D: ['𝐃', '𝐷', '𝑫', '𝒟', '𝓓', '𝕯', '𝔻', '𝖣', '𝗗', '𝘋', '𝘿', '𝙳'],
  E: ['𝐄', '𝐸', '𝑬', 'ℰ', '𝓔', '𝕰', '𝔼', '𝖤', '𝗘', '𝘌', '𝙀', '𝙴'],
  F: ['𝐅', '𝐹', '𝑭', 'ℱ', '𝓕', '𝕱', '𝔽', '𝖥', '𝗙', '𝘍', '𝙁', '𝙵'],
  G: ['𝐆', '𝐺', '𝑮', '𝒢', '𝓖', '𝕲', '𝔾', '𝖦', '𝗚', '𝘎', '𝙂', '𝙶'],
  H: ['𝐇', '𝐻', '𝑯', 'ℋ', '𝓗', '𝕳', 'ℍ', '𝖧', '𝗛', '𝘏', '𝙃', '𝙷'],
  I: ['𝐈', '𝐼', '𝑰', 'ℐ', '𝓘', '𝕴', '𝕀', '𝖨', '𝗜', '𝘐', '𝙄', '𝙸'],
  J: ['𝐉', '𝐽', '𝑱', '𝒥', '𝓙', '𝕵', '𝕁', '𝖩', '𝗝', '𝘑', '𝙅', '𝙹'],
  K: ['𝐊', '𝐾', '𝑲', '𝒦', '𝓚', '𝕶', '𝕂', '𝖪', '𝗞', '𝘒', '𝙆', '𝙺'],
  L: ['𝐋', '𝐿', '𝑳', 'ℒ', '𝓛', '𝕷', '𝕃', '𝖫', '𝗟', '𝘓', '𝙇', '𝙻'],
  M: ['𝐌', '𝑀', '𝑴', 'ℳ', '𝓜', '𝕸', '𝕄', '𝖬', '𝗠', '𝘔', '𝙈', '𝙼'],
  N: ['𝐍', '𝑁', '𝑵', '𝒩', '𝓝', '𝕹', 'ℕ', '𝖭', '𝗡', '𝘕', '𝙉', '𝙽'],
  O: ['𝐎', '𝑂', '𝑶', '𝒪', '𝓞', '𝕺', '𝕆', '𝖮', '𝗢', '𝘖', '𝙊', '𝙾'],
  P: ['𝐏', '𝑃', '𝑷', '𝒫', '𝓟', '𝕻', 'ℙ', '𝖯', '𝗣', '𝘗', '𝙋', '𝙿'],
  Q: ['𝐐', '𝑄', '𝑸', '𝒬', '𝓠', '𝕼', 'ℚ', '𝖰', '𝗤', '𝘘', '𝙌', '𝚀'],
  R: ['𝐑', '𝑅', '𝑹', 'ℛ', '𝓡', '𝕽', 'ℝ', '𝖱', '𝗥', '𝘙', '𝙍', '𝚁'],
  S: ['𝐒', '𝑆', '𝑺', '𝒮', '𝓢', '𝕾', '𝕊', '𝖲', '𝗦', '𝘚', '𝙎', '𝚂'],
  T: ['𝐓', '𝑇', '𝑻', '𝒯', '𝓣', '𝕿', '𝕋', '𝖳', '𝗧', '𝘛', '𝙏', '𝚃'],
  U: ['𝐔', '𝑈', '𝑼', '𝒰', '𝓤', '𝖀', '𝕌', '𝖴', '𝗨', '𝘜', '𝙐', '𝚄'],
  V: ['𝐕', '𝑉', '𝑽', '𝒱', '𝓥', '𝖁', '𝕍', '𝖵', '𝗩', '𝘝', '𝙑', '𝚅'],
  W: ['𝐖', '𝑊', '𝑾', '𝒲', '𝓦', '𝖂', '𝕎', '𝖶', '𝗪', '𝘞', '𝙒', '𝚆'],
  X: ['𝐗', '𝑋', '𝑿', '𝒳', '𝓧', '𝖃', '𝕏', '𝖷', '𝗫', '𝘟', '𝙓', '𝚇'],
  Y: ['𝐘', '𝑌', '𝒀', '𝒴', '𝓨', '𝖄', '𝕐', '𝖸', '𝗬', '𝘠', '𝙔', '𝚈'],
  Z: ['𝐙', '𝑍', '𝒁', '𝒵', '𝓩', '𝖅', 'ℤ', '𝖹', '𝗭', '𝘡', '𝙕', '𝚉'],

  a: ['𝐚', '𝑎', '𝒂', '𝒶', '𝓪', '𝖆', '𝕒', '𝖺', '𝗮', '𝘢', '𝙖', '𝚊'],
  b: ['𝐛', '𝑏', '𝒃', '𝒷', '𝓫', '𝖇', '𝕓', '𝖻', '𝗯', '𝘣', '𝙗', '𝚋'],
  c: ['𝐜', '𝑐', '𝒄', '𝒸', '𝓬', '𝖈', '𝕔', '𝖼', '𝗰', '𝘤', '𝙘', '𝚌'],
  d: ['𝐝', '𝑑', '𝒅', '𝒹', '𝓭', '𝖉', '𝕕', '𝖽', '𝗱', '𝘥', '𝙙', '𝚍'],
  e: ['𝐞', '𝑒', '𝒆', 'ℯ', '𝓮', '𝖊', '𝕖', '𝖾', '𝗲', '𝘦', '𝙚', '𝚎'],
  f: ['𝐟', '𝑓', '𝒇', '𝒻', '𝓯', '𝖋', '𝕗', '𝖿', '𝗳', '𝘧', '𝙛', '𝚏'],
  g: ['𝐠', '𝑔', '𝒈', 'ℊ', '𝓰', '𝖌', '𝕘', '𝗀', '𝗴', '𝘨', '𝙜', '𝚐'],
  h: ['𝐡', 'ℎ', '𝒉', '𝒽', '𝓱', '𝖍', '𝕙', '𝗁', '𝗵', '𝘩', '𝙝', '𝚑'],
  i: ['𝐢', '𝑖', '𝒊', '𝒾', '𝓲', '𝖎', '𝕚', '𝗂', '𝗶', '𝘪', '𝙞', '𝚒'],
  j: ['𝐣', '𝑗', '𝒋', '𝒿', '𝓳', '𝖏', '𝕛', '𝗃', '𝗷', '𝘫', '𝙟', '𝚓'],
  k: ['𝐤', '𝑘', '𝒌', '𝓀', '𝓴', '𝖐', '𝕜', '𝗄', '𝗸', '𝘬', '𝙠', '𝚔'],
  l: ['𝐥', '𝑙', '𝒍', '𝓁', '𝓵', '𝖑', '𝕝', '𝗅', '𝗹', '𝘭', '𝙡', '𝚕'],
  m: ['𝐦', '𝑚', '𝒎', '𝓂', '𝓶', '𝖒', '𝕞', '𝗆', '𝗺', '𝘮', '𝙢', '𝚖'],
  n: ['𝐧', '𝑛', '𝒏', '𝓃', '𝓷', '𝖓', '𝕟', '𝗇', '𝗻', '𝘯', '𝙣', '𝚗'],
  o: ['𝐨', '𝑜', '𝒐', 'ℴ', '𝓸', '𝖔', '𝕠', '𝗈', '𝗼', '𝘰', '𝙤', '𝚘'],
  p: ['𝐩', '𝑝', '𝒑', '𝓅', '𝓹', '𝖕', '𝕡', '𝗉', '𝗽', '𝘱', '𝙥', '𝚙'],
  q: ['𝐪', '𝑞', '𝒒', '𝓆', '𝓺', '𝖖', '𝕢', '𝗊', '𝗾', '𝘲', '𝙦', '𝚚'],
  r: ['𝐫', '𝑟', '𝒓', '𝓇', '𝓻', '𝖗', '𝕣', '𝗋', '𝗿', '𝘳', '𝙧', '𝚛'],
  s: ['𝐬', '𝑠', '𝒔', '𝓈', '𝓼', '𝖘', '𝕤', '𝗌', '𝘀', '𝘴', '𝙨', '𝚜'],
  t: ['𝐭', '𝑡', '𝒕', '𝓉', '𝓽', '𝖙', '𝕥', '𝗍', '𝘁', '𝘵', '𝙩', '𝚝'],
  u: ['𝐮', '𝑢', '𝒖', '𝓊', '𝓾', '𝖚', '𝕦', '𝗎', '𝘂', '𝘶', '𝙪', '𝚞'],
  v: ['𝐯', '𝑣', '𝒗', '𝓋', '𝓿', '𝖛', '𝕧', '𝗏', '𝘃', '𝘷', '𝙫', '𝚟'],
  w: ['𝐰', '𝑤', '𝒘', '𝓌', '𝔀', '𝖜', '𝕨', '𝗐', '𝘄', '𝘸', '𝙬', '𝚠'],
  x: ['𝐱', '𝑥', '𝒙', '𝓍', '𝔁', '𝖝', '𝕩', '𝗑', '𝘅', '𝘹', '𝙭', '𝚡'],
  y: ['𝐲', '𝑦', '𝒚', '𝓎', '𝔂', '𝖞', '𝕪', '𝗒', '𝘆', '𝘺', '𝙮', '𝚢'],
  z: ['𝐳', '𝑧', '𝒛', '𝓏', '𝔃', '𝖟', '𝕫', '𝗓', '𝘇', '𝘻', '𝙯', '𝚣'],
};

export const styledDigits: StyledLetterMap = {
  0: ['𝟎', '𝟘', '𝟢', '𝟬', '𝟶'],
  1: ['𝟏', '𝟙', '𝟣', '𝟭', '𝟷'],
  2: ['𝟐', '𝟚', '𝟤', '𝟮', '𝟸'],
  3: ['𝟑', '𝟛', '𝟥', '𝟯', '𝟹'],
  4: ['𝟒', '𝟜', '𝟦', '𝟰', '𝟺'],
  5: ['𝟓', '𝟝', '𝟧', '𝟱', '𝟻'],
  6: ['𝟔', '𝟞', '𝟨', '𝟲', '𝟼'],
  7: ['𝟕', '𝟟', '𝟩', '𝟳', '𝟽'],
  8: ['𝟖', '𝟠', '𝟪', '𝟴', '𝟾'],
  9: ['𝟗', '𝟡', '𝟫', '𝟵', '𝟿'],
};

export const styledGreek: StyledLetterMap = {
  'Α': ['𝚨', '𝛢', '𝜜', '𝝖', '𝞐'], // Alpha
  'Β': ['𝚩', '𝛣', '𝜝', '𝝗', '𝞑'], // Beta
  'Γ': ['𝚪', '𝛤', '𝜞', '𝝘', '𝞒'], // Gamma
  'Δ': ['𝚫', '𝛥', '𝜟', '𝝙', '𝞓'], // Delta
  'Ε': ['𝚬', '𝛦', '𝜠', '𝝚', '𝞔'], // Epsilon
  'Ζ': ['𝚭', '𝛧', '𝜡', '𝝛', '𝞕'], // Zeta
  'Η': ['𝚮', '𝛨', '𝜢', '𝝜', '𝞖'], // Eta
  'Θ': ['𝚯', '𝛩', '𝜣', '𝝝', '𝞗'], // Theta
  'Ι': ['𝚰', '𝛪', '𝜤', '𝝞', '𝞘'], // Iota
  'Κ': ['𝚱', '𝛫', '𝜥', '𝝟', '𝞙'], // Kappa
  'Λ': ['𝚲', '𝛬', '𝜦', '𝝠', '𝞚'], // Lambda
  'Μ': ['𝚳', '𝛭', '𝜧', '𝝡', '𝞛'], // Mu
  'Ν': ['𝚴', '𝛮', '𝜨', '𝝢', '𝞜'], // Nu
  'Ξ': ['𝚵', '𝛯', '𝜩', '𝝣', '𝞝'], // Xi
  'Ο': ['𝚶', '𝛰', '𝜪', '𝝤', '𝞞'], // Omicron
  'Π': ['𝚷', '𝛱', '𝜫', '𝝥', '𝞟'], // Pi
  'Ρ': ['𝚸', '𝛲', '𝜬', '𝝦', '𝞠'], // Rho
  'ϴ': ['𝚹', '𝛳', '𝜭', '𝝧', '𝞡'], // Theta symbol (variant)
  'Σ': ['𝚺', '𝛴', '𝜮', '𝝨', '𝞢'], // Sigma
  'Τ': ['𝚻', '𝛵', '𝜯', '𝝩', '𝞣'], // Tau
  'Υ': ['𝚼', '𝛶', '𝜰', '𝝪', '𝞤'], // Upsilon
  'Φ': ['𝚽', '𝛷', '𝜱', '𝝫', '𝞥'], // Phi
  'Χ': ['𝚾', '𝛸', '𝜲', '𝝬', '𝞦'], // Chi
  'Ψ': ['𝚿', '𝛹', '𝜳', '𝝭', '𝞧'], // Psi
  'Ω': ['𝛀', '𝛺', '𝜴', '𝝮', '𝞨'], // Omega
  '∇': ['𝛁', '𝛻', '𝜵', '𝝯', '𝞩'], // Nabla

  'α': ['𝛂', '𝛼', '𝜶', '𝝰', '𝞪'], // alpha
  'β': ['𝛃', '𝛽', '𝜷', '𝝱', '𝞫'], // beta
  'γ': ['𝛄', '𝛾', '𝜸', '𝝲', '𝞬'], // gamma
  'δ': ['𝛅', '𝛿', '𝜹', '𝝳', '𝞭'], // delta
  'ε': ['𝛆', '𝜀', '𝜺', '𝝴', '𝞮'], // epsilon
  'ζ': ['𝛇', '𝜁', '𝜻', '𝝵', '𝞯'], // zeta
  'η': ['𝛈', '𝜂', '𝜼', '𝝶', '𝞰'], // eta
  'θ': ['𝛉', '𝜃', '𝜽', '𝝷', '𝞱'], // theta
  'ι': ['𝛊', '𝜄', '𝜾', '𝝸', '𝞲'], // iota
  'κ': ['𝛋', '𝜅', '𝜿', '𝝹', '𝞳'], // kappa
  'λ': ['𝛌', '𝜆', '𝝀', '𝝺', '𝞴'], // lambda
  'μ': ['𝛍', '𝜇', '𝝁', '𝝻', '𝞵'], // mu
  'ν': ['𝛎', '𝜈', '𝝂', '𝝼', '𝞶'], // nu
  'ξ': ['𝛏', '𝜉', '𝝃', '𝝽', '𝞷'], // xi
  'ο': ['𝛐', '𝜊', '𝝄', '𝝾', '𝞸'], // omicron
  'π': ['𝛑', '𝜋', '𝝅', '𝝿', '𝞹'], // pi
  'ρ': ['𝛒', '𝜌', '𝝆', '𝞀', '𝞺'], // rho
  'ς': ['𝛓', '𝜍', '𝝇', '𝞁', '𝞻'], // final sigma
  'σ': ['𝛔', '𝜎', '𝝈', '𝞂', '𝞼'], // sigma
  'τ': ['𝛕', '𝜏', '𝝉', '𝞃', '𝞽'], // tau
  'υ': ['𝛖', '𝜐', '𝝊', '𝞄', '𝞾'], // upsilon
  'φ': ['𝛗', '𝜑', '𝝋', '𝞅', '𝞿'], // phi (φ)
  'χ': ['𝛘', '𝜒', '𝝌', '𝞆', '𝟀'], // chi
  'ψ': ['𝛙', '𝜓', '𝝍', '𝞇', '𝟁'], // psi
  'ω': ['𝛚', '𝜔', '𝝎', '𝞈', '𝟂'], // omega
  '∂': ['𝛛', '𝜕', '𝝏', '𝞉', '𝟃'], // partial differential
  'ϵ': ['𝛜', '𝜖', '𝝐', '𝞊', '𝟄'], // epsilon (lunate variant)
  'ϑ': ['𝛝', '𝜗', '𝝑', '𝞋', '𝟅'], // theta symbol
  'ϰ': ['𝛞', '𝜘', '𝝒', '𝞌', '𝟆'], // kappa symbol
  'ϕ': ['𝛟', '𝜙', '𝝓', '𝞍', '𝟇'], // phi symbol
  'ϱ': ['𝛠', '𝜚', '𝝔', '𝞎', '𝟈'], // rho symbol
  'ϖ': ['𝛡', '𝜛', '𝝕', '𝞏', '𝟉'], // pi symbol
};
